print(10 + 5)

# integer - целое число
# int
# 5, 9, 20, 1000, -56, -34, 0

#float - числа с плавающей точкой

# 0.12, 3.14, 0.00000000004,  .4 

#   + - /  *    ** степень,    // деление на цело   % остаток от деления

# print(9 % 2)


# print(4 ** 25)


print( (10 + 11 + 12) / 3)

print(125213 % 4652)

name = 'John'
age = 23

firstName = 'dfgdfg'
FirstName = 'dfgdfg'
first_name = 'dfgdfg'

name1 = 'Jack'

# 24324 = 'fsdgsd'

# 1person = 'dsa' нельзя

# human*$ нельзя

# for = 'dsad'


num1 = 12
num2 = 34

print(num2 - num1)

age = 26

# print('I am ', age)

# print('I am ', age,  ' yo')

# print('i am' + age + 'yo')

print(f'I am {age} years')


# Написать программу, которая вычисляет сумму чаевых по ставке 10%, 
# которую нужно оставить в ресторане. Создайте переменную с суммой счета и выпишите суммарный счет.

print((100 * .1) + 100)